
#pragma once

//----------------------------------------------------------------------------------
//
//----------------------------------------------------------------------------------
#include <ace.common.Base.h>
#include <Math/ace.Vector2DI.h>
#include "../ace.ReferenceObject.h"

//----------------------------------------------------------------------------------
//
//----------------------------------------------------------------------------------
namespace ace {
//----------------------------------------------------------------------------------
//
//----------------------------------------------------------------------------------
/**
	@brief	メインウインドウを操作するクラス
*/
class Window
	: public IReference
{
protected:
	Window(){}
	virtual ~Window(){}
public:

	/**
		@brief	イベント処理を行う。
		@return	ウインドウが存続可能か
	*/
	virtual bool DoEvent() = 0;

	/**
		@brief	タイトルを設定する。
		@param	title	[in]	タイトル
	*/
	virtual void SetTitle( const achar* title ) = 0;

	/**
		@brief	ウインドウを閉じる。
	*/
	virtual void Close() = 0;

	/**
		@brief	画面サイズを取得する。
		@return	画面サイズ
	*/
	virtual Vector2DI GetSize() const = 0;
};

//----------------------------------------------------------------------------------
//
//----------------------------------------------------------------------------------
}