#ifndef PSD_C_H_
#define PSD_C_H_

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#define PSD_C_VERSION_MAJOR 0
#define PSD_C_VERSION_MINOR 1
#define PSD_C_VERSION_RELEASE 0
#define PSD_C_VERSION_PATCH 0
#define PSD_C_VERSION_STRING "0.1.0.0"

#include <stddef.h> /* size_t */
#include <limits.h> /* INT_MAX */
#include <stdio.h>
#include <stdint.h>

#ifdef PSD_PLATFORM_WIN32
#include <windows.h>
#endif /* PSD_PLATFORM_WIN32 */

#ifndef __STDC_VERSION__
#define __STDC_VERSION__ 0
#endif /* __STDC_VERSION__ */

#if __STDC_VERSION__ >= 201112L /* C11 */
#ifndef PSD_STATIC_ASSERT
#define PSD_STATIC_ASSERT(cond, message) _Static_assert((cond), (message))
#endif /* PSD_STATIC_ASSERT */
//typedef rsize_t psd_rsize_t;
typedef size_t psd_rsize_t;
#else
#define __PSD_SA_CONCAT(a, b) __PSD_SA_CONCAT2(a, b)
#define __PSD_SA_CONCAT2(a, b) a ## b
#ifndef PSD_STATIC_ASSERT
#define PSD_STATIC_ASSERT(cond, message) \
    enum { __PSD_SA_CONCAT(PSD_STATIC_ASSERT, __LINE__) = \
    sizeof(struct { int static_assertion_failed[(cond) ? 1 : -1]; }) }
#endif /* PSD_STATIC_ASSERT */
typedef size_t psd_rsize_t;
#endif /* __STDC_VERSION__ >= 201112L */

#if __STDC_VERSION__ >= 199901L /* C99 */
#include <stdbool.h>
#include <stdint.h>
#ifndef PSD_DECL_INLINE
#define PSD_DECL_INLINE inline
#endif /* PSD_DECL_INLINE */
typedef _Bool psd_bool_t;
typedef uint8_t psd_uint8_t;
typedef int16_t psd_int16_t;
typedef uint16_t psd_uint16_t;
typedef int32_t psd_int32_t;
typedef uint32_t psd_uint32_t;
typedef int64_t psd_int64_t;
typedef uint64_t psd_uint64_t;
#define psd_false false
#define psd_true true
#else
#ifndef PSD_DECL_INLINE
#define PSD_DECL_INLINE
#endif /* PSD_DECL_INLINE */
typedef unsigned char psd_uint8_t;
typedef short psd_int16_t;
typedef unsigned short psd_uint16_t;
typedef int psd_int32_t;
typedef unsigned int psd_uint32_t;
typedef long int psd_int64_t;
typedef unsigned long int psd_uint64_t;
enum psd_bool_t {
    psd_false,
    psd_true,
    PSD_BOOL_SIZE_ALIGNMENT = 0x7fffffff
};
typedef enum psd_bool_t psd_bool_t;
#endif /* __STDC_VERSION__ >= 199901L */

typedef float psd_float32_t;
typedef double psd_float64_t;

#ifndef PSD_DECL_API
#define PSD_DECL_API extern
#endif /* PSD_DECL_API */

#if !defined(PSD_API_ENTRY) && defined(PSD_PLATFORM_WIN32)
#define PSD_API_ENTRY WINAPI
#else
#define PSD_API_ENTRY
#endif /* PSD_API_ENTRY */

#ifndef PSD_MAKE_TAG
#define PSD_MAKE_TAG(a, b, c, d) ((a) << 24 | (b) << 16 | (c) << 8 | (d))
#endif /* PSD_MAKE_TAG */

#ifndef PSD_NULL
#define PSD_NULL NULL
#endif /* psd_null */

#ifdef _MSC_VER

#else

//#if __STDC_VERSION__ >= 199901L /* C99 */
//#else
//
//PSD_STATIC_ASSERT(sizeof(psd_uint8_t)  == 1, "size of psd_uint8_t must be 1");
//PSD_STATIC_ASSERT(sizeof(psd_int16_t) == 2, "size of psd_int16_t must be 2");
//PSD_STATIC_ASSERT(sizeof(psd_uint16_t) == 2, "size of psd_uint16_t must be 2");
//PSD_STATIC_ASSERT(sizeof(psd_int32_t) == 4, "size of psd_int32_t must be 4");
//PSD_STATIC_ASSERT(sizeof(psd_uint32_t) == 4, "size of psd_uint32_t must be 4");
//PSD_STATIC_ASSERT(sizeof(psd_int64_t) == 8, "size of psd_int64_t must be 8");
//PSD_STATIC_ASSERT(sizeof(psd_uint64_t) == 8, "size of psd_uint64_t must be 8");
//
//#endif

#endif

typedef struct psd_global_allocator_t psd_global_allocator_t;
typedef struct psd_size_t psd_size_t;
typedef struct psd_rect_t psd_rect_t;
typedef struct psd_resource_guide_t psd_resource_guide_t;
typedef struct psd_blending_range_color_pair_value_t psd_blending_range_color_pair_value_t;
typedef struct psd_blending_range_color_pair_t psd_blending_range_color_pair_t;
typedef struct psd_blending_range_t psd_blending_range_t;
typedef struct psd_descriptor_unit_t psd_descriptor_unit_t;
typedef struct psd_descriptor_value_t psd_descriptor_value_t;
typedef struct psd_descriptor_t psd_descriptor_t;
typedef struct psd_document_t psd_document_t;
typedef struct psd_buffer_t psd_buffer_t;
typedef struct psd_header_t psd_header_t;
typedef struct psd_resource_slice_t psd_resource_slice_t;
typedef struct psd_resource_slice_container_t psd_resource_slice_container_t;
